# Payroll Exploratory Analysis

Hi,

Let's explore real payroll data of Chicago city. This data is available on kaggle website and can be downloaded using the provided link (https://www.kaggle.com/chicago/chicago-citywide-payroll-data).

**1. Let's Import pandas as pd.**

In [1]:
import pandas as pd

**2. Let's read our csv file as a dataframe in pay.**

In [3]:
payroll = pd.read_csv('City_of_Chicago_Payroll_Data.csv')

**3. Inspecting the first five records in the data.**

In [4]:
payroll.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"ALLISON, PAUL W",LIEUTENANT,FIRE,F,Salary,NaN,$107790.00,NaN
1,"BRUNO, KEVIN D",SERGEANT,POLICE,F,Salary,NaN,$104628.00,NaN
2,"COOPER, JOHN E",LIEUTENANT-EMT,FIRE,F,Salary,NaN,$114324.00,NaN
3,"CRESPO, VILMA I",STAFF ASST,LAW,F,Salary,NaN,$76932.00,NaN
4,"DOLAN, ROBERT J",SERGEANT,POLICE,F,Salary,NaN,$111474.00,NaN

**3. Overview of our data.**

In [5]:
payroll.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32658 entries, 0 to 32657
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Name               32658 non-null  object
 1   Job Titles         32658 non-null  object
 2   Department         32658 non-null  object
 3   Full or Part-Time  32658 non-null  object
 4   Salary or Hourly   32658 non-null  object
 5   Typical Hours      7883 non-null   float64
 6   Annual Salary      24775 non-null  object
 7   Hourly Rate        7883 non-null   object
dtypes: float64(1), object(7)
memory usage: 2.0+ MB

**4. Let's check how many 'NaN' we have in each column in our data**

In [11]:
print(payroll.isnull().sum().sort_values(ascending = False))

Typical Hours        24775
Hourly Rate          24775
Annual Salary         7883
Name                     0
Job Titles               0
Department               0
Full or Part-Time        0
Salary or Hourly         0
dtype: int64

5. **Outputing the statistics of our dataset.**

In [12]:
payroll.describe(include = 'all')

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
count,32658,32658,32658,32658,32658,7883.000000,24775,7883
unique,32350,1095,36,2,2,NaN,1038,167
top,"HERNANDEZ, JUAN C",POLICE OFFICER,POLICE,F,Salary,NaN,$90024.00,$35.60
freq,5,9393,12973,30676,24775,NaN,2368,1404
mean,NaN,NaN,NaN,NaN,NaN,34.698719,NaN,NaN
std,NaN,NaN,NaN,NaN,NaN,9.145553,NaN,NaN
min,NaN,NaN,NaN,NaN,NaN,10.000000,NaN,NaN
25%,NaN,NaN,NaN,NaN,NaN,20.000000,NaN,NaN
50%,NaN,NaN,NaN,NaN,NaN,40.000000,NaN,NaN
75%,NaN,NaN,NaN,NaN,NaN,40.000000,NaN,NaN
max,NaN,NaN,NaN,NaN,NaN,40.000000,NaN,NaN

Let's answer some interesting questions!

**6. What are the maximum, minimum and average Typical Hours?**

In [13]:
print('Max. Typical Hours:', payroll['Typical Hours'].max())
print('Min. Typical Hours:', payroll['Typical Hours'].min())
print('Avg. Typical Hours:', payroll['Typical Hours'].mean())

Max. Typical Hours: 40.0
Min. Typical Hours: 10.0
Avg. Typical Hours: 34.69871876189268

**7. How many employees are on salary and how many are working on hourly basis?**

In [15]:
payroll.groupby('Salary or Hourly').count()

,Name,Job Titles,Department,Full or Part-Time,Typical Hours,Annual Salary,Hourly Rate
Salary or Hourly,,,,,,,
Hourly,7883,7883,7883,7883,7883,0,7883
Salary,24775,24775,24775,24775,0,24775,0

**8. Which department has maximum no of employees?**

In [17]:
payroll['Department'].value_counts().head(3)

POLICE           12973
FIRE              4800
STREETS & SAN     2194
Name: Department, dtype: int64

**9. How many employees are on Salary and how many are on Hourly in the Police department?**

In [19]:
payroll[payroll['Department'] == 'POLICE'].groupby('Salary or Hourly').count()['Department']

Salary or Hourly
Hourly       32
Salary    12941
Name: Department, dtype: int64

**10. What are the mean, max and min salaries?**

In [19]:
# Let's add Salary column before performing our calculations
payroll['Salary'] = payroll['Annual Salary'].str.extract(r'(\d+\.\d+)').astype(float)

In [20]:
payroll.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Salary
0,"ALLISON, PAUL W",LIEUTENANT,FIRE,F,Salary,NaN,$107790.00,NaN,107790.0
1,"BRUNO, KEVIN D",SERGEANT,POLICE,F,Salary,NaN,$104628.00,NaN,104628.0
2,"COOPER, JOHN E",LIEUTENANT-EMT,FIRE,F,Salary,NaN,$114324.00,NaN,114324.0
3,"CRESPO, VILMA I",STAFF ASST,LAW,F,Salary,NaN,$76932.00,NaN,76932.0
4,"DOLAN, ROBERT J",SERGEANT,POLICE,F,Salary,NaN,$111474.00,NaN,111474.0

In [22]:
print('Max. Salary:', payroll['Salary'].max())
print('Min. Salary:', payroll['Salary'].min())
print('Mean/AVG. Salary:', payroll['Salary'].mean())

Max. Salary: 300000.0
Min. Salary: 0.96
Mean/AVG. Salary: 87512.78024137235

**11. Which employee who has the maximum salary?**

In [24]:
payroll[payroll['Salary'] == payroll['Salary'].max()]

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Salary
8310,"EVANS, GINGER S",COMMISSIONER OF AVIATION,AVIATION,F,Salary,NaN,$300000.00,NaN,300000.0

In [26]:
# Alternatively, we can rewrite the code above this way
payroll.loc[payroll['Salary'].idxmax()]

Name                         EVANS,  GINGER S
Job Titles           COMMISSIONER OF AVIATION
Department                           AVIATION
Full or Part-Time                           F
Salary or Hourly                       Salary
Typical Hours                             NaN
Annual Salary                      $300000.00
Hourly Rate                               NaN
Salary                               300000.0
Name: 8310, dtype: object

**12. Which employee has the minimum salary?**

In [27]:
payroll.loc[payroll['Salary'].idxmin()]

Name                           KOCH,  STEVEN
Job Titles           ADMINISTRATIVE SECRETARY
Department                     MAYOR'S OFFICE
Full or Part-Time                           F
Salary or Hourly                       Salary
Typical Hours                             NaN
Annual Salary                           $0.96
Hourly Rate                               NaN
Salary                                   0.96
Name: 15387, dtype: object

In [28]:
# Alternatively, we can rewrite the code above this way
payroll[payroll['Salary']== payroll['Salary'].min()]

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Salary
15387,"KOCH, STEVEN",ADMINISTRATIVE SECRETARY,MAYOR'S OFFICE,F,Salary,NaN,$0.96,NaN,0.96

**13. What are the mean, max and min Hourly Rate**

In [33]:
# Let's create a new column called H_Rate first
payroll['H_Rate']=payroll['Hourly Rate'].str.extract(r'(\d+\.\d+)').astype(float)
payroll.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Salary,H_Rate
0,"ALLISON, PAUL W",LIEUTENANT,FIRE,F,Salary,NaN,$107790.00,NaN,107790.0,NaN
1,"BRUNO, KEVIN D",SERGEANT,POLICE,F,Salary,NaN,$104628.00,NaN,104628.0,NaN
2,"COOPER, JOHN E",LIEUTENANT-EMT,FIRE,F,Salary,NaN,$114324.00,NaN,114324.0,NaN
3,"CRESPO, VILMA I",STAFF ASST,LAW,F,Salary,NaN,$76932.00,NaN,76932.0,NaN
4,"DOLAN, ROBERT J",SERGEANT,POLICE,F,Salary,NaN,$111474.00,NaN,111474.0,NaN

In [34]:
print('Mean/AVG Hourly Rate:', payroll['H_Rate'].mean())
print('Max. Hourly Rate:', payroll['H_Rate'].max())
print('Min. Hourly Rate:', payroll['H_Rate'].min())

Mean/AVG Hourly Rate: 32.86819231257135
Max. Hourly Rate: 96.0
Min. Hourly Rate: 2.65

**14. How many employees are getting max Hourly Rate?**

In [38]:
payroll[payroll['H_Rate'] == payroll['H_Rate'].max()].count()

Name                 1
Job Titles           1
Department           1
Full or Part-Time    1
Salary or Hourly     1
Typical Hours        1
Annual Salary        0
Hourly Rate          1
Salary               0
H_Rate               1
dtype: int64

**15. Who is getting max Hourly Rate?**

In [39]:
payroll[payroll['H_Rate'] == payroll['H_Rate'].max()]

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Salary,H_Rate
14317,"JONES, JOHN W",PSYCHIATRIST,HEALTH,F,Hourly,35.0,NaN,$96.00,NaN,96.0

**16. How many employees are earning less than the average Hourly Rate?**

In [46]:
payroll[payroll['H_Rate'] < payroll['H_Rate'].mean()].count()['H_Rate']

2791

**17. How many employees are paid hourly and they have full-time job?**

In [52]:
payroll[(payroll['H_Rate'].notnull()) & (payroll['Full or Part-Time'] == 'F')].count()['Full or Part-Time']

5906

**18. How many full-time employees are working at hourly rate of $10.00?**

In [53]:
payroll[(payroll['H_Rate'] == 10) & (payroll['Full or Part-Time'] == 'F')]

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Salary,H_Rate
1232,"AYALA JR, JESUS",STUDENT INTERN,HUMAN RESOURCES,F,Hourly,35.0,NaN,$10.00,NaN,10.0
4522,"CERVANTES, BIANCA A",STUDENT INTERN,BUDGET & MGMT,F,Hourly,35.0,NaN,$10.00,NaN,10.0
6476,"DAVILA, ROBERTO A",ALDERMANIC AIDE,CITY COUNCIL,F,Hourly,35.0,NaN,$10.00,NaN,10.0
16474,"LEVY, ETHAN",CLERK CITY COUNCIL,CITY COUNCIL,F,Hourly,35.0,NaN,$10.00,NaN,10.0

**19. How many unique Job Titles are there in the data?**

In [55]:
payroll['Job Titles'].nunique()

1095

**20. What is the average Salary of the employees in each department?**

In [56]:
payroll.groupby('Department').mean()['Salary']

C:\Users\Administrator\AppData\Local\Temp\ipykernel_6476\2237669575.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  payroll.groupby('Department').mean()['Salary']

Department
ADMIN HEARNG             78912.947368
ANIMAL CONTRL            66089.684211
AVIATION                 76140.018777
BOARD OF ELECTION        56051.142857
BOARD OF ETHICS          94552.500000
BUDGET & MGMT            93925.395349
BUILDINGS                98864.833534
BUSINESS AFFAIRS         80446.425000
CITY CLERK               69762.439024
CITY COUNCIL             63577.172069
COMMUNITY DEVELOPMENT    88363.257143
COPA                     98784.705882
CULTURAL AFFAIRS         87048.909091
DISABILITIES             82431.724138
DoIT                     99681.029703
FAMILY & SUPPORT         79013.588785
FINANCE                  73276.364662
FIRE                     97762.348662
GENERAL SERVICES         83095.528390
HEALTH                   85488.210938
HUMAN RELATIONS          93778.588235
HUMAN RESOURCES          79851.761194
INSPECTOR GEN            84030.666667
IPRA                     94429.285714
LAW                      84582.814404
LICENSE APPL COMM        80568.000000
MAYOR'S OFFICE           96165.512308
OEMC                     73153.778221
POLICE                   87836.025349
POLICE BOARD             86136.000000
PROCUREMENT              83278.243902
PUBLIC LIBRARY           71273.288136
STREETS & SAN            84347.775701
TRANSPORTN               89976.896061
TREASURER                88062.652174
WATER MGMNT              89894.111803
Name: Salary, dtype: float64

**21. What is the job title of 'AGAR, BULENT B'?**

In [63]:
payroll[payroll['Name'] == 'AGAR,  BULENT B']['Job Titles']

230    CHIEF ENGINEER OF SEWERS
Name: Job Titles, dtype: object

**22. What are the top most common job titles?**

In [64]:
payroll['Job Titles'].value_counts().head()

POLICE OFFICER                            9393
FIREFIGHTER-EMT                           1424
SERGEANT                                  1118
POOL MOTOR TRUCK DRIVER                    996
POLICE OFFICER (ASSIGNED AS DETECTIVE)     845
Name: Job Titles, dtype: int64

**23. How many people have the word 'officer' in their job title?**

In [72]:
def find_string(title):
    if 'officer' in title.lower():
        return True
    else:
        return False

In [73]:
sum(payroll['Job Titles'].apply(lambda x: find_string(x)))

11101

# Thank you!